//引起二义性理解的逻辑表达式，必须使用括号显式说明优先级顺序。
int main(void)
{
    int i = 0, j = 1, k = 2;
	int a=0;
    //......
    if((0 == i) || (1 == j) && (2 == k))      //违背1
    {
       a++;
    }
	else 
	{
		a--;
	}
    if((1 == i)&&(0 == j)||(2 == k))        //违背2
    {
        a++;
    }
	else{
		a-- ;
	}
	if(!(0 == i)&&(0 == j))                //违背3
	{
		a++;
	}
	else {
		a--;
	}
	if(!(0 == k)||(1 == j))               //违背4
	{
		a++;
	}
	else {
		a--;
	}
	if((0==i)&&(2==j)&&(5==k))          //违背5
	{
		a++;
	}
	else 
	{
		a--;
	}
	if((2==i)||(3==j)||(4==k))          //违背6
	{
		a++;
	}
	else 
	{
		a--;
	}
    return (0);
}
